{
  "ninos_no_lectores": [
    {
      "id": "1",
      "pregunta": "Noé, un hombre que amaba mucho a Dios, recibió la misión de construir un gran barco. ¿Sabes cómo se le llama a ese gran barco que construyó?",
      "opciones": ["Una canoa", "Un arca", "Un submarino"],
      "respuesta_correcta": "Un arca",
      "imagen_pregunta": "arca_con_animales.png",
      "leccion": "La historia de Noé nos enseña sobre la obediencia y la confianza en Dios."
    },
    {
      "id": "2",
      "pregunta": "Un pequeño pastor llamado David se enfrentó a un gigante muy grande llamado Goliat. David solo tenía una honda y su fe en Dios. ¿Quién fue el valiente pastor que ganó la batalla?",
      "opciones": ["Sansón", "Saúl", "David"],
      "respuesta_correcta": "David",
      "imagen_pregunta": "david_y_goliat.png",
      "leccion": "No importa cuán grande sea el desafío, con Dios somos valientes y fuertes."
    },
    {
      "id": "3",
      "pregunta": "Jonás no quería obedecer a Dios y se subió a un barco para huir. Pero una gran tormenta lo tiró al agua, y fue tragado por un animal muy grande. ¿Qué animal se lo tragó?",
      "opciones": ["Un león", "Un pez muy grande", "Un dragón"],
      "respuesta_correcta": "Un pez muy grande",
      "imagen_pregunta": "jonas_y_la_ballena.png",
      "leccion": "Dios siempre nos da una segunda oportunidad para obedecerle."
    },
    {
      "id": "4",
      "pregunta": "Moisés fue un bebé que su mamá puso en una canasta en el río para que se salvara. ¿Qué gran milagro hizo Moisés cuando creció para que su pueblo pudiera escapar de sus enemigos?",
      "opciones": ["Caminó sobre el agua", "Abrió el Mar Rojo", "Multiplicó la comida"],
      "respuesta_correcta": "Abrió el Mar Rojo",
      "imagen_pregunta": "moises_mar_rojo.png",
      "leccion": "Dios nos salva y nos protege de los peligros."
    },
    {
      "id": "5",
      "pregunta": "Jesús es el Hijo de Dios. Un día, con solo cinco panes y dos peces, ¿qué hizo para que más de 5,000 personas pudieran comer?",
      "opciones": ["Multiplicó el pan y el pescado", "Pidió a la gente que compartiera", "Compró más comida"],
      "respuesta_correcta": "Multiplicó el pan y el pescado",
      "imagen_pregunta": "multiplicacion_panes_peces.png",
      "leccion": "Con Jesús, lo poco que tenemos puede ser más que suficiente."
    },
    {
      "id": "6",
      "pregunta": "Dios creó el mundo en seis días. ¿Qué creó Dios en el primer día?",
      "opciones": ["Los animales", "La luz", "Las plantas"],
      "respuesta_correcta": "La luz",
      "imagen_pregunta": "creacion_luz.png",
      "leccion": "Dios es el creador de todo lo que existe."
    },
    {
      "id": "7",
      "pregunta": "Jesús nació en un lugar muy humilde. ¿Dónde nació el niño Jesús?",
      "opciones": ["En un palacio", "En un establo", "En un hospital"],
      "respuesta_correcta": "En un establo",
      "imagen_pregunta": "nacimiento_jesus.png",
      "leccion": "Jesús vino al mundo con humildad para salvarnos."
    },
    {
      "id": "8",
      "pregunta": "Daniel era un hombre que oraba a Dios todos los días. Por eso, sus enemigos lo echaron a un foso con estos animales hambrientos. ¿Qué animales eran?",
      "opciones": ["Leones", "Tigres", "Osos"],
      "respuesta_correcta": "Leones",
      "imagen_pregunta": "daniel_leones.png",
      "leccion": "Dios protege a quienes confían en Él."
    },
    {
      "id": "9",
      "pregunta": "Jesús hizo muchos milagros. ¿A qué persona Jesús devolvió la vida después de cuatro días de haber muerto?",
      "opciones": ["A Lázaro", "A Juan", "A Pedro"],
      "respuesta_correcta": "A Lázaro",
      "imagen_pregunta": "resurreccion_lazaro.png",
      "leccion": "Jesús tiene poder sobre la vida y la muerte."
    }
  ],
  "ninos_lectores": [
    {
      "id": "10",
      "pregunta": "Jesús nos enseñó con historias llamadas 'parábolas'. En la parábola del hijo pródigo, el hijo menor se fue y gastó todo su dinero, pero al regresar, su padre lo recibió con una fiesta. ¿Qué nos enseña esta historia sobre el amor de Dios?",
      "opciones": ["Que Dios nos castiga por nuestros errores.", "Que Dios nos perdona y celebra cuando regresamos a Él.", "Que es malo gastar todo nuestro dinero."],
      "respuesta_correcta": "Que Dios nos perdona y celebra cuando regresamos a Él.",
      "versiculo_clave": "Lucas 15:11-32"
    },
    {
      "id": "11",
      "pregunta": "En el Sermón del Monte, Jesús dijo que debíamos ser 'sal de la tierra' y 'luz del mundo'. ¿Qué crees que quiso decir Jesús con 'luz del mundo'?",
      "opciones": ["Que debemos brillar en la oscuridad.", "Que debemos ser un buen ejemplo para los demás.", "Que debemos usar lámparas."],
      "respuesta_correcta": "Que debemos ser un buen ejemplo para los demás.",
      "versiculo_clave": "Mateo 5:14-16"
    },
    {
      "id": "12",
      "pregunta": "Cuando Jesús fue a la tumba de Lázaro, él le dijo a Marta: 'Yo soy la resurrección y la vida; el que cree en mí, aunque esté muerto, vivirá'. ¿Qué verdad fundamental sobre la vida después de la muerte nos revela Jesús en este pasaje?",
      "opciones": ["Que la vida se acaba cuando morimos.", "Que los que creen en Él tendrán vida eterna.", "Que la fe solo importa en esta vida."],
      "respuesta_correcta": "Que los que creen en Él tendrán vida eterna.",
      "versiculo_clave": "Juan 11:25-26"
    },
    {
      "id": "13",
      "pregunta": "El apóstol Pablo, en 1 Corintios 13, nos habla sobre el amor. ¿Qué nos dice Pablo que es más importante que hablar en lenguas o tener todo el conocimiento?",
      "opciones": ["La fe y la esperanza.", "La caridad y el perdón.", "El amor."],
      "respuesta_correcta": "El amor.",
      "versiculo_clave": "1 Corintios 13:13"
    },
    {
      "id": "14",
      "pregunta": "Jesús nos enseñó a orar con el Padrenuestro. En esta oración, le pedimos a Dios que 'venga tu reino'. ¿Qué significa pedirle a Dios que Su reino venga a la Tierra?",
      "opciones": ["Que Dios gobierne nuestro corazón y el mundo.", "Que Dios haga una fiesta en el cielo.", "Que un rey de verdad venga a la Tierra."],
      "respuesta_correcta": "Que Dios gobierne nuestro corazón y el mundo.",
      "versiculo_clave": "Mateo 6:9-13"
    },
    {
      "id": "15",
      "pregunta": "En la parábola del buen samaritano, ¿qué hizo el samaritano cuando encontró a un hombre herido en el camino?",
      "opciones": ["Pasó de largo como los demás.", "Lo ayudó y cuidó de él.", "Llamó a la policía."],
      "respuesta_correcta": "Lo ayudó y cuidó de él.",
      "versiculo_clave": "Lucas 10:30-37"
    },
    {
      "id": "16",
      "pregunta": "¿Cuál fue la señal que Dios le dio a Noé de que nunca más destruiría la tierra con un diluvio?",
      "opciones": ["Un arcoíris en las nubes.", "Una paloma con una rama de olivo.", "Una estrella brillante."],
      "respuesta_correcta": "Un arcoíris en las nubes.",
      "versiculo_clave": "Génesis 9:13"
    },
    {
      "id": "17",
      "pregunta": "¿Qué le prometió Dios a Abraham sobre sus descendientes?",
      "opciones": ["Que serían pocos como las estrellas.", "Que serían tan numerosos como las estrellas del cielo.", "Que vivirían siempre en la misma tierra."],
      "respuesta_correcta": "Que serían tan numerosos como las estrellas del cielo.",
      "versiculo_clave": "Génesis 15:5"
    },
    {
      "id": "18",
      "pregunta": "¿Qué hicieron los amigos de Daniel cuando se negaron a adorar la estatua de oro del rey Nabucodonosor?",
      "opciones": ["Huyeron del reino.", "Se escondieron en sus casas.", "Fueron echados en un horno de fuego."],
      "respuesta_correcta": "Fueron echados en un horno de fuego.",
      "versiculo_clave": "Daniel 3:20-21"
    },
    {
      "id": "19",
      "pregunta": "¿Qué le dijo Jesús a la mujer samaritana junto al pozo de Jacob?",
      "opciones": ["Que le diera de beber.", "Que podía darle agua viva.", "Que regresara a su casa."],
      "respuesta_correcta": "Que podía darle agua viva.",
      "versiculo_clave": "Juan 4:10"
    }
  ],
  "adultos": [
    {
      "id": "20",
      "pregunta": "La Biblia nos revela que Dios es misericordioso y lleno de gracia. ¿Cuál es la principal diferencia entre la 'misericordia' de Dios y su 'gracia'?",
      "opciones": [
        "La misericordia es el perdón de los pecados, y la gracia es una recompensa merecida.",
        "La misericordia es no darnos lo que merecemos (el castigo), y la gracia es darnos lo que no merecemos (el favor y el regalo de la salvación).",
        "No hay diferencia, ambos términos significan lo mismo."
      ],
      "respuesta_correcta": "La misericordia es no darnos lo que merecemos (el castigo), y la gracia es darnos lo que no merecemos (el favor y el regalo de la salvación).",
      "reflexion": "Entender la distinción entre la misericordia y la gracia nos permite apreciar la profundidad del sacrificio de Cristo en la cruz y el regalo de la salvación que hemos recibido."
    },
    {
      "id": "21",
      "pregunta": "Según Filipenses 2:3, el apóstol Pablo nos exhorta a no hacer nada por contienda o vanagloria, sino con humildidad. ¿Cómo podemos aplicar este principio para cultivar la humildad en nuestras relaciones diarias?",
      "opciones": [
        "Pensando que somos mejores que los demás.",
        "Poniendo los intereses de los demás antes que los nuestros y reconociendo nuestras propias debilidades.",
        "Haciendo siempre lo que los demás quieren, sin importar lo que pensemos."
      ],
      "respuesta_correcta": "Poniendo los intereses de los demás antes que los nuestros y reconociendo nuestras propias debilidades.",
      "reflexion": "La humildad no es pensar menos de nosotros mismos, sino pensar menos en nosotros mismos. Es la actitud que nos permite amar y servir a los demás como Jesús lo hizo."
    },
    {
      "id": "22",
      "pregunta": "En Juan 14:16, Jesús promete que el Padre nos enviará a otro 'Consolador'. ¿Qué rol desempeña el Espíritu Santo en la vida de un creyente, según lo que nos revela el Nuevo Testamento?",
      "opciones": [
        "Es un ángel que nos protege.",
        "Es una fuerza invisible que nos hace tener éxito en todo lo que hacemos.",
        "Nos guía a toda verdad, nos consuela, nos capacita y nos revela a Cristo."
      ],
      "respuesta_correcta": "Nos guía a toda verdad, nos consuela, nos capacita y nos revela a Cristo.",
      "reflexion": "El Espíritu Santo no es solo una idea, sino una persona de la Trinidad que vive en el creyente. Su presencia es fundamental para vivir una vida que honre a Dios y para entender Su Palabra."
    },
    {
      "id": "23",
      "pregunta": "La fe es un concepto central en la Biblia. Según Hebreos 11:1, ¿cómo se define la fe?",
      "opciones": [
        "La convicción de lo que se ve.",
        "La certeza de lo que se espera y la convicción de lo que no se ve.",
        "Un sentimiento de esperanza."
      ],
      "respuesta_correcta": "La certeza de lo que se espera y la convicción de lo que no se ve.",
      "reflexion": "La fe bíblica no es una creencia ciega, sino una confianza firme y segura en las promesas de Dios, basadas en su carácter y fidelidad demostrada a lo largo de la historia."
    },
    {
      "id": "24",
      "pregunta": "El apóstol Pablo escribe que 'todas las cosas ayudan a bien a los que aman a Dios'. ¿Cómo se relaciona esta afirmación con la soberanía de Dios en medio del sufrimiento?",
      "opciones": [
        "Que los cristianos nunca sufren.",
        "Que Dios no tiene control sobre las circunstancias difíciles.",
        "Que Dios tiene un propósito redentor incluso en las situaciones más dolorosas y que Él puede usar el mal para lograr un bien mayor."
      ],
      "respuesta_correcta": "Que Dios tiene un propósito redentor incluso en las situaciones más dolorosas y que Él puede usar el mal para lograr un bien mayor.",
      "reflexion": "Romanos 8:28 no es una promesa de que las cosas malas no nos pasarán, sino una garantía de que Dios puede obrar en ellas para nuestra santificación y Su gloria, si permanecemos en Él."
    },
    {
      "id": "25",
      "pregunta": "Según Gálatas 5:22-23, ¿cuáles son los nueve frutos del Espíritu Santo?",
      "opciones": [
        "Amor, gozo, paz, paciencia, benignidad, bondad, fe, mansedumbre, templanza",
        "Sabiduría, entendimiento, consejo, fortaleza, ciencia, piedad, temor de Dios",
        "Profecía, servicio, enseñanza, exhortación, repartir, presidir, misericordia"
      ],
      "respuesta_correcta": "Amor, gozo, paz, paciencia, benignidad, bondad, fe, mansedumbre, templanza",
      "reflexion": "Los frutos del Espíritu son evidencias de la obra transformadora de Dios en nuestras vidas. No son esfuerzos humanos, sino resultados de permitir que el Espíritu Santo nos guíe y moldee."
    },
    {
      "id": "26",
      "pregunta": "En el Sermón del Monte, Jesús menciona varias bienaventuranzas. ¿Qué significa 'bienaventurados los pobres en espíritu, porque de ellos es el reino de los cielos'?",
      "opciones": [
        "Que Dios favorece a las personas con pocos recursos económicos.",
        "Que quienes reconocen su necesidad espiritual y dependen completamente de Dios heredarán Su reino.",
        "Que las personas tristes y deprimidas recibirán consuelo en el cielo."
      ],
      "respuesta_correcta": "Que quienes reconocen su necesidad espiritual y dependen completamente de Dios heredarán Su reino.",
      "reflexion": "Ser 'pobre en espíritu' significa reconocer nuestra bancarrota espiritual y nuestra total dependencia de Dios. Es la actitud opuesta al orgullo y la autosuficiencia."
    },
    {
      "id": "27",
      "pregunta": "¿Qué significa la expresión 'Jehová es mi pastor' en el Salmo 23?",
      "opciones": [
        "Que Dios cuida de nosotros como un pastor cuida de sus ovejas.",
        "Que debemos trabajar como pastores para servir a Dios.",
        "Que las ovejas son importantes para Dios."
      ],
      "respuesta_correcta": "Que Dios cuida de nosotros como un pastor cuida de sus ovejas.",
      "reflexion": "Esta metáfora del pastor representa la provisión, protección, guía y cuidado constante de Dios hacia nosotros. Él conoce nuestras necesidades y nos conduce por caminos de bien."
    },
    {
      "id": "28",
      "pregunta": "Según Efesios 6:11, ¿qué significa 'vestirse de toda la armadura de Dios'?",
      "opciones": [
        "Usar ropa especial para la batalla espiritual.",
        "Apropiarse de la protección espiritual que Dios provee contra las artimañas del diablo.",
        "Prepararse físicamente para enfrentar dificultades."
      ],
      "respuesta_correcta": "Apropiarse de la protección espiritual que Dios provee contra las artimañas del diablo.",
      "reflexion": "La armadura de Dios representa las verdades espirituales que nos protegen en la batalla contra el mal: la verdad, la justicia, el evangelio, la fe, la salvación y la Palabra de Dios."
    },
    {
      "id": "29",
      "pregunta": "En 1 Corintios 15:3-4, Pablo resume el evangelio esencial. ¿Qué elementos incluye este resumen?",
      "opciones": [
        "Que Cristo nació de una virgen y realizó milagros.",
        "Que Cristo murió por nuestros pecados, fue sepultado y resucitó al tercer día.",
        "Que Cristo ascendió al cielo y vendrá otra vez."
      ],
      "respuesta_correcta": "Que Cristo murió por nuestros pecados, fue sepultado y resucitó al tercer día.",
      "reflexion": "El núcleo del evangelio es la muerte, sepultura y resurrección de Jesús. Su muerte fue sacrificial por nuestros pecados, y Su resurrección confirmó Su victoria sobre la muerte y Su identidad como Hijo de Dios."
    }
  ],
  "logros": [
    {
      "id": "disciplina_de_niño",
      "titulo": "Discípulo Principiante",
      "descripcion": "Completa el nivel de 'Niños Pequeños' con al menos 3 preguntas correctas.",
      "criterios": {
        "nivel": "ninos_no_lectores",
        "puntuacion_minima": 3
      }
    },
    {
      "id": "sabio_de_la_biblia",
      "titulo": "Sabio de la Biblia",
      "descripcion": "Completa el nivel de 'Adultos' con todas las preguntas correctas (5 de 5).",
      "criterios": {
        "nivel": "adultos",
        "puntuacion_minima": 5
      }
    },
    {
      "id": "estudiante_aplicado",
      "titulo": "Estudiante Aplicado",
      "descripcion": "Completa el nivel de 'Niños Lectores' con todas las preguntas correctas (5 de 5).",
      "criterios": {
        "nivel": "ninos_lectores",
        "puntuacion_minima": 5
      }
    },
    {
      "id": "explorador_biblico",
      "titulo": "Explorador Bíblico",
      "descripcion": "Completa al menos un nivel en cada categoría.",
      "criterios": {
        "niveles_completados": ["ninos_no_lectores", "ninos_lectores", "adultos"]
      }
    }
  ]
}
